Tekla Open API Reference for Tekla Structures 2025
Distance.FromDecimalString Method (String, IFormatProvider)
 Creates a distance from a decimal string representation.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance FromDecimalString(
	string text,
	IFormatProvider formatProvider
)
Public Shared Function FromDecimalString (
	text As String,
	formatProvider As IFormatProvider
) As Distance
Parameters
text
Type: System.String
The distance string.
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: Distance
The representation of the specified distance.
Exceptions
Exception | Condition
FormatException | Thrown if the text does not represent a distance.
Examples
 This example shows how to specify a format provider when parsing a Distance instance from a decimal string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           Distance distance = Distance.FromDecimalString("3.2", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
FromDecimalString Overload
Tekla.Structures.Datatype Namespace